XmlJsonConvertService/src/main/java/com/dxc/converter/model/PRMService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!--(C)Copyright 2019 DXC.technology. All rights reserved.--><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.csc.smart/bo/services/PRM" name="PRMService.wsdl" targetNamespace="http://www.csc.smart/bo/services/PRM" xmlns:m1rq="http://www.csc.smart/bo/schemas/PRMCALI" xmlns:m1rs="http://www.csc.smart/bo/schemas/PRMCALO"><wsdl:types xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><xsd:schema targetNamespace="http://www.csc.smart/bo/services/PRM" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><xsd:import namespace="http://www.csc.smart/bo/schemas/PRMCALI" schemaLocation="PRMCALISchema.xsd"/><xsd:import namespace="http://www.csc.smart/bo/schemas/PRMCALO" schemaLocation="PRMCALOSchema.xsd"/></xsd:schema></wsdl:types><wsdl:message name="PRMCALRequest" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><wsdl:part element="m1rq:PRMCALI_REC" name="PRMCALRQ"/></wsdl:message><wsdl:message name="PRMCALResponse" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><wsdl:part element="m1rs:PRMCALO_REC" name="PRMCALRS"/></wsdl:message><wsdl:portType name="PRM" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><wsdl:operation name="PRMCAL"><wsdl:input message="tns:PRMCALRequest"/><wsdl:output message="tns:PRMCALResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="PRMBinding" type="tns:PRM" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="PRMCAL"><soap:operation soapAction="PRMCALAction"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="PRMService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"><wsdl:port binding="tns:PRMBinding" name="PRMServicePort"><soap:address location="http://localhost:9080/LiFEWebServices/services/PRMService"/></wsdl:port></wsdl:service></wsdl:definitions>