XmlJsonConvertService/doc/xml/premium_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prm="http://www.csc.smart/bo/schemas/PRMCALI">
   <soapenv:Header/>
   <soapenv:Body>
<prm:PRMCALI_REC xmlns:prm="http://www.csc.smart/bo/schemas/PRMCALI" xmlns:msp="http://www.csc.smart/msp/schemas/MSPContext">
  <!--Optional:-->
  <msp:MSPContext>
    <!--Optional:-->
    <msp:UserId>MSPNCLA</msp:UserId>
    <msp:UserPassword>MSPuser1)</msp:UserPassword>
    <msp:RequestParameters>
      <!--Zero or more repetitions:-->
      <msp:RequestParameter name="BRANCH" value="SY" />
      <msp:RequestParameter name="COMMIT_FLAG" value="Y" />
      <msp:RequestParameter name="COMPANY" value="2" />
      <msp:RequestParameter name="IGNORE_DRIVER_HELD" value="Y" />
      <msp:RequestParameter name="LANGUAGE" value="S" />
      <msp:RequestParameter name="SUPPRESS_RCLRSC" value="N" />
    </msp:RequestParameters>
  </msp:MSPContext>
  <PREMIUM>
    <ZNBAKFLD>Y</ZNBAKFLD>
    <CNTBRANCH>SY</CNTBRANCH>
    <TTMPRCNO>081000243242</TTMPRCNO>
    <CHDRTYPE />
    <OCCDATE>20190319</OCCDATE>
    <POLICYOWNER>
      <OWNERSEL>02651759</OWNERSEL>
      <DOB>19880910</DOB>
      <AGE>50</AGE>
      <CLTSEX>F</CLTSEX>
      <OCCUP>A001</OCCUP>
    </POLICYOWNER>
    <BILLFREQ>01</BILLFREQ>
    <SRCEBUS>1</SRCEBUS>
    <CNTCURR>CNY</CNTCURR>
    <BILLCURR>CNY</BILLCURR>
    <!--1 to 2 repetitions:-->
    <INSUREDLIST>
      <INSURED>
        <LIFE>01</LIFE>
        <LIFCNUM />
        <CLTDOB>20040201</CLTDOB>
        <INSAGE>50</INSAGE> <!-- Insured Age-->
        <SEX>M</SEX> <!-- Input Sex-->
        <OCCUPD>V092</OCCUPD>
        <PACKAGEINFO>
          <ZNPKGCODE />
          <TOTPRE>0</TOTPRE>
          <ZTOTSI>0</ZTOTSI>
        </PACKAGEINFO>
        <!--1 to 9 repetitions:-->
        <COVERAGELIST>
          <COVERAGEINFO>
            <COVERAGE>01</COVERAGE>
            <CCDATE>20190319</CCDATE>
            <RIDER>00</RIDER>
            <ZNPRDCODE>CA10TA</ZNPRDCODE>
            <SUMIN>100000</SUMIN><!-- Sum Insured-->
            <ZNDISPER>1</ZNDISPER>
            <ZNRFAGE>999</ZNRFAGE> 
            <RCESSAGE>0</RCESSAGE><!-- Benefit Cess age-->
            <RCESSTRM>20</RCESSTRM><!-- Benefit Cess Term-->
            <PCESSTRM>20</PCESSTRM><!-- Premium Cess Term-->
            <PCESSAGE>0</PCESSAGE><!-- Premium Cess age-->
            <INSTPRM>0</INSTPRM> <!-- Basic Premium-->
            <JLSEX />
            <ZNJLAGE>0</ZNJLAGE>
            <BENPLN />
            <LIVESNO />
          </COVERAGEINFO>
         <COVERAGEINFO>
            <COVERAGE>01</COVERAGE>
            <CCDATE>20190319</CCDATE>
            <RIDER>00</RIDER>
            <ZNPRDCODE>CA10TA</ZNPRDCODE>
            <SUMIN>200000</SUMIN><!-- Sum Insured-->
            <ZNDISPER>1</ZNDISPER>
            <ZNRFAGE>999</ZNRFAGE> 
            <RCESSAGE>0</RCESSAGE><!-- Benefit Cess age-->
            <RCESSTRM>20</RCESSTRM><!-- Benefit Cess Term-->
            <PCESSTRM>20</PCESSTRM><!-- Premium Cess Term-->
            <PCESSAGE>0</PCESSAGE><!-- Premium Cess age-->
            <INSTPRM>0</INSTPRM> <!-- Basic Premium-->
            <JLSEX />
            <ZNJLAGE>0</ZNJLAGE>
            <BENPLN />
            <LIVESNO />
          </COVERAGEINFO>     
          <COVERAGEINFO>
            <COVERAGE>01</COVERAGE>
            <CCDATE>20190319</CCDATE>
            <RIDER>00</RIDER>
            <ZNPRDCODE>CA10TA</ZNPRDCODE>
            <SUMIN>100000</SUMIN><!-- Sum Insured-->
            <ZNDISPER>1</ZNDISPER>
            <ZNRFAGE>999</ZNRFAGE> 
            <RCESSAGE>0</RCESSAGE><!-- Benefit Cess age-->
            <RCESSTRM>20</RCESSTRM><!-- Benefit Cess Term-->
            <PCESSTRM>20</PCESSTRM><!-- Premium Cess Term-->
            <PCESSAGE>0</PCESSAGE><!-- Premium Cess age-->
            <INSTPRM>0</INSTPRM> <!-- Basic Premium-->
            <JLSEX />
            <ZNJLAGE>0</ZNJLAGE>
            <BENPLN />
            <LIVESNO />
          </COVERAGEINFO>              
           </COVERAGELIST>
      </INSURED>
    </INSUREDLIST>
  </PREMIUM>
</prm:PRMCALI_REC>


   </soapenv:Body>
</soapenv:Envelope>