XmlJsonConvertService/doc/xml/Response.xml

<soap:Envelope
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<b:PRMCALO_REC
			xmlns:a="http://www.csc.smart/bo/schemas/PRMCALI"
			xmlns:c="http://www.csc.smart/msp/schemas/MSPContext"
			xmlns:b="http://www.csc.smart/bo/schemas/PRMCALO"
			xmlns:d="http://www.csc.smart/bo/schemas/Error"
			xmlns:ns6="http://service.converter.prm.dxc.com">
			<STATUS>0</STATUS>
			<MORE_IND>N</MORE_IND>
			<PREMIUM>
				<ERRCODE>0</ERRCODE>
				<PDESC></PDESC>
				<ZNBAKFLD></ZNBAKFLD>
				<CNTBRANCH>SY</CNTBRANCH>
				<TTMPRCNO>081000243242</TTMPRCNO>
				<TOTAL>3348.00</TOTAL>
				<OCCDATE>20190319</OCCDATE>
				<INSUREDLIST>
					<INSURED>
						<LIFE>01</LIFE>
						<INSRSKAMNT>
							<ZNRSKCD02>ASLI</ZNRSKCD02>
							<SUMINS02>100000</SUMINS02>
						</INSRSKAMNT>
						<INSRSKAMNT>
							<ZNRSKCD02>ASCI</ZNRSKCD02>
							<SUMINS02>200000</SUMINS02>
						</INSRSKAMNT>
						<INSRSKAMNT>
							<ZNRSKCD02>ATCI</ZNRSKCD02>
							<SUMINS02>300000</SUMINS02>
						</INSRSKAMNT>
						<INSRSKAMNT>
							<ZNRSKCD02>AACI</ZNRSKCD02>
							<SUMINS02>100000</SUMINS02>
						</INSRSKAMNT>
						<INSRSKAMNT>
							<ZNRSKCD02>ATLI</ZNRSKCD02>
							<SUMINS02>100000</SUMINS02>
						</INSRSKAMNT>
						<INSRSKAMNT>
							<ZNRSKCD02>ASJI</ZNRSKCD02>
							<SUMINS02>100000</SUMINS02>
						</INSRSKAMNT>
						<COVERAGELIST>
							<COVERAGEINFO>
								<COVERAGE>01</COVERAGE>
								<RIDER>00</RIDER>
								<ZNPRDCODE>PWL03AA</ZNPRDCODE>
								<RCESSAGE>106</RCESSAGE>
								<RCESSTRM></RCESSTRM>
								<PCESSAGE>35</PCESSAGE>
								<PCESSTRM></PCESSTRM>
								<BCESSAGE></BCESSAGE>
								<BCESSTRM></BCESSTRM>
								<SUMIN>100000</SUMIN>
								<INSTPRM>2412.00</INSTPRM>
								<CASHVALUELIST />
							</COVERAGEINFO>
							<COVERAGEINFO>
								<COVERAGE>01</COVERAGE>
								<RIDER>00</RIDER>
								<ZNPRDCODE>DD08AA</ZNPRDCODE>
								<RCESSAGE>25</RCESSAGE>
								<RCESSTRM></RCESSTRM>
								<PCESSAGE>25</PCESSAGE>
								<PCESSTRM></PCESSTRM>
								<BCESSAGE></BCESSAGE>
								<BCESSTRM></BCESSTRM>
								<SUMIN>200000</SUMIN>
								<INSTPRM>402.00</INSTPRM>
								<CASHVALUELIST />
							</COVERAGEINFO>
							<COVERAGEINFO>
								<COVERAGE>01</COVERAGE>
								<RIDER>00</RIDER>
								<ZNPRDCODE>ACI15AA</ZNPRDCODE>
								<RCESSAGE>106</RCESSAGE>
								<RCESSTRM></RCESSTRM>
								<PCESSAGE>35</PCESSAGE>
								<PCESSTRM></PCESSTRM>
								<BCESSAGE></BCESSAGE>
								<BCESSTRM></BCESSTRM>
								<SUMIN>100000</SUMIN>
								<INSTPRM>534.00</INSTPRM>
								<CASHVALUELIST />
							</COVERAGEINFO>
						</COVERAGELIST>
					</INSURED>
				</INSUREDLIST>
			</PREMIUM>
		</b:PRMCALO_REC>
	</soap:Body>
</soap:Envelope>