XmlJsonConvertService/doc/xml/premium_response.xml

<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <b:PRMCALO_REC
            xmlns:a="http://www.csc.smart/bo/schemas/PRMCALI"
            xmlns:c="http://www.csc.smart/msp/schemas/MSPContext"
            xmlns:b="http://www.csc.smart/bo/schemas/PRMCALO"
            xmlns:d="http://www.csc.smart/bo/schemas/Error">
            <STATUS>0</STATUS>
            <MORE_IND>N</MORE_IND>
            <PREMIUM>
                <ERRCODE>0</ERRCODE>
                <PDESC></PDESC>
                <ZNBAKFLD>Y</ZNBAKFLD>
                <CNTBRANCH>SY</CNTBRANCH>
                <TTMPRCNO>081000243242</TTMPRCNO>
                <TOTAL>8540.00</TOTAL>
                <OCCDATE>20190319</OCCDATE>
                <OWNRSKAMNT>
                    <ZNRSKCD>TSCI</ZNRSKCD>
                    <SUMINS>100000</SUMINS>
                </OWNRSKAMNT>
                <OWNRSKAMNT>
                    <ZNRSKCD>ASCI</ZNRSKCD>
                    <SUMINS>100000</SUMINS>
                </OWNRSKAMNT>
                <OWNRSKAMNT>
                    <ZNRSKCD>TSCI</ZNRSKCD>
                    <SUMINS>200000</SUMINS>
                </OWNRSKAMNT>
                <OWNRSKAMNT>
                    <ZNRSKCD>ASCI</ZNRSKCD>
                    <SUMINS>200000</SUMINS>
                </OWNRSKAMNT>
                <OWNRSKAMNT>
                    <ZNRSKCD>TSCI</ZNRSKCD>
                    <SUMINS>100000</SUMINS>
                </OWNRSKAMNT>
                <OWNRSKAMNT>
                    <ZNRSKCD>ASCI</ZNRSKCD>
                    <SUMINS>100000</SUMINS>
                </OWNRSKAMNT>
                <INSUREDLIST>
                    <INSURED>
                        <LIFE>01</LIFE>
                        <COVERAGELIST>
                            <COVERAGEINFO>
                                <COVERAGE>01</COVERAGE>
                                <RIDER>00</RIDER>
                                <ZNPRDCODE>CA10TA</ZNPRDCODE>
                                <RCESSAGE></RCESSAGE>
                                <RCESSTRM>20</RCESSTRM>
                                <PCESSAGE></PCESSAGE>
                                <PCESSTRM>20</PCESSTRM>
                                <BCESSAGE></BCESSAGE>
                                <BCESSTRM></BCESSTRM>
                                <SUMIN>100000</SUMIN>
                                <INSTPRM>2135.00</INSTPRM>
                                <CASHVALUELIST>
                                    <CVYEAR>
                                        <YEAR>1</YEAR>
                                        <ZDCSHVA>242.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>2</YEAR>
                                        <ZDCSHVA>871.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>3</YEAR>
                                        <ZDCSHVA>1473.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>4</YEAR>
                                        <ZDCSHVA>2273.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>5</YEAR>
                                        <ZDCSHVA>3048.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>6</YEAR>
                                        <ZDCSHVA>3766.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>7</YEAR>
                                        <ZDCSHVA>4433.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>8</YEAR>
                                        <ZDCSHVA>5033.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>9</YEAR>
                                        <ZDCSHVA>5550.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>10</YEAR>
                                        <ZDCSHVA>5963.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>11</YEAR>
                                        <ZDCSHVA>6353.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>12</YEAR>
                                        <ZDCSHVA>6647.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>13</YEAR>
                                        <ZDCSHVA>6821.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>14</YEAR>
                                        <ZDCSHVA>6818.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>15</YEAR>
                                        <ZDCSHVA>6601.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>16</YEAR>
                                        <ZDCSHVA>6100.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>17</YEAR>
                                        <ZDCSHVA>5272.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>18</YEAR>
                                        <ZDCSHVA>4042.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>19</YEAR>
                                        <ZDCSHVA>2323.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>20</YEAR>
                                        <ZDCSHVA>0.00</ZDCSHVA>
                                    </CVYEAR>
                                </CASHVALUELIST>
                            </COVERAGEINFO>
                            <COVERAGEINFO>
                                <COVERAGE>01</COVERAGE>
                                <RIDER>00</RIDER>
                                <ZNPRDCODE>CA10TA</ZNPRDCODE>
                                <RCESSAGE></RCESSAGE>
                                <RCESSTRM>20</RCESSTRM>
                                <PCESSAGE></PCESSAGE>
                                <PCESSTRM>20</PCESSTRM>
                                <BCESSAGE></BCESSAGE>
                                <BCESSTRM></BCESSTRM>
                                <SUMIN>200000</SUMIN>
                                <INSTPRM>4270.00</INSTPRM>
                                <CASHVALUELIST>
                                    <CVYEAR>
                                        <YEAR>1</YEAR>
                                        <ZDCSHVA>484.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>2</YEAR>
                                        <ZDCSHVA>1742.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>3</YEAR>
                                        <ZDCSHVA>2946.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>4</YEAR>
                                        <ZDCSHVA>4546.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>5</YEAR>
                                        <ZDCSHVA>6096.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>6</YEAR>
                                        <ZDCSHVA>7532.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>7</YEAR>
                                        <ZDCSHVA>8866.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>8</YEAR>
                                        <ZDCSHVA>10066.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>9</YEAR>
                                        <ZDCSHVA>11100.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>10</YEAR>
                                        <ZDCSHVA>11926.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>11</YEAR>
                                        <ZDCSHVA>12706.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>12</YEAR>
                                        <ZDCSHVA>13294.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>13</YEAR>
                                        <ZDCSHVA>13642.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>14</YEAR>
                                        <ZDCSHVA>13636.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>15</YEAR>
                                        <ZDCSHVA>13202.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>16</YEAR>
                                        <ZDCSHVA>12200.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>17</YEAR>
                                        <ZDCSHVA>10544.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>18</YEAR>
                                        <ZDCSHVA>8084.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>19</YEAR>
                                        <ZDCSHVA>4646.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>20</YEAR>
                                        <ZDCSHVA>0.00</ZDCSHVA>
                                    </CVYEAR>
                                </CASHVALUELIST>
                            </COVERAGEINFO>
                            <COVERAGEINFO>
                                <COVERAGE>01</COVERAGE>
                                <RIDER>00</RIDER>
                                <ZNPRDCODE>CA10TA</ZNPRDCODE>
                                <RCESSAGE></RCESSAGE>
                                <RCESSTRM>20</RCESSTRM>
                                <PCESSAGE></PCESSAGE>
                                <PCESSTRM>20</PCESSTRM>
                                <BCESSAGE></BCESSAGE>
                                <BCESSTRM></BCESSTRM>
                                <SUMIN>100000</SUMIN>
                                <INSTPRM>2135.00</INSTPRM>
                                <CASHVALUELIST>
                                    <CVYEAR>
                                        <YEAR>1</YEAR>
                                        <ZDCSHVA>242.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>2</YEAR>
                                        <ZDCSHVA>871.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>3</YEAR>
                                        <ZDCSHVA>1473.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>4</YEAR>
                                        <ZDCSHVA>2273.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>5</YEAR>
                                        <ZDCSHVA>3048.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>6</YEAR>
                                        <ZDCSHVA>3766.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>7</YEAR>
                                        <ZDCSHVA>4433.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>8</YEAR>
                                        <ZDCSHVA>5033.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>9</YEAR>
                                        <ZDCSHVA>5550.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>10</YEAR>
                                        <ZDCSHVA>5963.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>11</YEAR>
                                        <ZDCSHVA>6353.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>12</YEAR>
                                        <ZDCSHVA>6647.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>13</YEAR>
                                        <ZDCSHVA>6821.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>14</YEAR>
                                        <ZDCSHVA>6818.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>15</YEAR>
                                        <ZDCSHVA>6601.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>16</YEAR>
                                        <ZDCSHVA>6100.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>17</YEAR>
                                        <ZDCSHVA>5272.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>18</YEAR>
                                        <ZDCSHVA>4042.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>19</YEAR>
                                        <ZDCSHVA>2323.00</ZDCSHVA>
                                    </CVYEAR>
                                    <CVYEAR>
                                        <YEAR>20</YEAR>
                                        <ZDCSHVA>0.00</ZDCSHVA>
                                    </CVYEAR>
                                </CASHVALUELIST>
                            </COVERAGEINFO>
                        </COVERAGELIST>
                    </INSURED>
                </INSUREDLIST>
            </PREMIUM>
        </b:PRMCALO_REC>
    </soap:Body>
</soap:Envelope>